#+OPTIONS: author:nil date:nil toc:nil  html-postamble:nil 
#+LATEX_HEADER: \usepackage[left=2cm, right=2cm, top=1.5cm, bottom=2cm]{geometry}
#+LATEX_HEADER: \usepackage[scaled]{helvet} \renewcommand\familydefault{\sfdefault}
#+LATEX_HEADER: \usepackage{anyfontsize}
#+LATEX_HEADER: \AtBeginDocument{\fontsize{14}{14}\selectfont}

** [[https://github.com/mschwartz/assembly-tutorial?tab=readme-ov-file#bit-shifting][Bit Shifting]]

shift a bit to the left (<< operator in C) 1-7 bits:

#+begin_src asm 
001111101b << 1 = 011111010b

 001111101b  shifted left becomes
 ////////
x011111010b  (bit 0 becomes 0, bit 1 becomes 1, bit 2 becomes 0)
#+end_src

Note that we have the overflow problem here, as we did with addition. We have an upper bit that ends up in the "bit bucket" (thrown away).

A *left shift* of *1 bit is effectively a multiplication by 2*.
Consider 001b<<1 is 010b, or 2.
A left shift of *2 bits is a multiply by 4*, and so on.

 - left shift of n bits:

| 128 | 64 | 32 | 16 | 8 | 4 | 2 | 1 | Dec |
|-----+----+----+----+---+---+---+---+-----|
|     |    |    |    |   | 0 | 0 | 1 |   1 |
|     |    |    |    |   | 0 | 1 | 0 |   2 |
|-----+----+----+----+---+---+---+---+-----|
|     |    |    |    |   | 0 | 0 | 1 |   1 |
|     |    |    |    |   | 1 | 0 | 0 |   4 |
|-----+----+----+----+---+---+---+---+-----|
|     |    |    |    |   | 0 | 0 | 1 |   1 |
|     |    |    |    | 1 | 0 | 0 | 0 |   8 |
|-----+----+----+----+---+---+---+---+-----|
|     |    |    |    |   | 0 | 0 | 1 |   1 |
|     |    |    |  1 | 0 | 0 | 0 | 0 |  16 |


Shifting to the right , but we now end up with the high bit being cleared and the low bit in the bit bucket.
A *right shift* of *1 bit is effectively a divide by 2*.
But this right shift will take a *negative number and make it positive* because the *sign bit is cleared*. 

So we need a second kind of right shift (*arithmetic shift right*)
for signed values that sets the high bit in the result to the high bit in the initial value.

A *rotation left/right* is the same as a shift,
except instead of the lost bit ending up in the bit bucket, it becomes the new high/low bit.

Other than for the multiply and divide effects, we use bit shifting frequently with Boolean Algebra.

#+begin_src 
To set bit 3:
n | (1<<3) 

To clear bit 3:

n & ~(1<<3)

Note that
  1<<3  =   01000b,
~(1<<3) is ~01000b,
        or  00111b, (all the bits are inverted)
When you and with 00111b, you are clearing bit 3
#+end_src


 - [[https://en.wikibooks.org/wiki/C_Programming/stdint.h#Exact-width_integer_types][Exact width integer types]]
 
| Specifier | Signing  | Bits | Bytes | Minimum Value | Maximum Value |
|-----------+----------+------+-------+---------------+---------------|
| int8_t    | Signed   |    8 |     1 | −2^{7}        | 2^{7}         |
| uint8_t   | Unsigned |    8 |     1 | 0             | 2^{8}         |
| int16_t   | Signed   |   16 |     2 | −2^{15}       | 2^{15}        |
| uint16_t  | Unsigned |   16 |     2 | 0             | 2^{16}        |
| int32_t   | Signed   |   32 |     4 | −2^{31}       | 2^{31}        |
| uint32_t  | Unsigned |   32 |     4 | 0             | 2^{32}        |
| int64_t   | Signed   |   64 |     8 | −2^{63}       | 2^{63}        |
| uint64_t  | Unsigned |   64 |     8 | 0             | 2^{64}        |


Set bit, chatGPT example: 

#+begin_src C :exports both  :results output 
#include <stdio.h>
#include <stdint.h>

uint16_t int_to_bin(uint16_t  k); 

int main(void) {
    uint16_t n = 9; 
    printf("before setting the bit 3: %u  ->   %u \n", n, int_to_bin(n));
    n = n | (1 << 3); // set bit 3 (from  0)
    printf("after setting the  bit 3: %u ->  %u \n", n, int_to_bin(n));
    return 0;
}

uint16_t int_to_bin(uint16_t  k) { 
  return ( k==0 || k == 1 ? k : ((k%2)+10*int_to_bin(k/2)));
}

#+end_src

#+RESULTS:
: before setting the bit 3: 9  ->   1001 
: after setting the  bit 3: 9 ->  1001 

#+begin_src 
OR (if either operand is true, the result is true)
0 | 0 = 0
0 | 1 = 1
1 | 0 = 1
1 | 1 = 1

n | (1<<3) 

  00000101  (n = 5)
| 00001000  (1 << 3 = 8)
------------
  00001101  (resultado = 13)
#+end_src

|   7 |  6 |  5 |  4 | *3* | 2 | 1 | 0 | Dec |
| 128 | 64 | 32 | 16 |   8 | 4 | 2 | 1 |     |
|-----+----+----+----+-----+---+---+---+-----|
|     |    |    |    |     | 1 | 0 | 1 |   5 |
|     |    |    |    |   1 | 1 | 0 | 1 |  13 |
|-----+----+----+----+-----+---+---+---+-----|
|     |    |    |    |     | 1 | 1 | 0 |   6 |
|     |    |    |    |   1 | 1 | 1 | 0 |  14 |
|-----+----+----+----+-----+---+---+---+-----|
|     |    |    |    |     | 1 | 1 | 1 |   7 |
|     |    |    |    |   1 | 1 | 1 | 1 |  15 |
|-----+----+----+----+-----+---+---+---+-----|
|     |    |    |    |   1 | 0 | 0 | 0 |   8 |
|     |    |    |    |   1 | 0 | 0 | 0 |   8 |
|-----+----+----+----+-----+---+---+---+-----|
|     |    |    |    |   1 | 0 | 0 | 1 |   9 |
|     |    |    |    |   1 | 0 | 0 | 1 |   9 |

